app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'
---
  def similar_movies #movies with the same director
    @movie = Movie.find params[:id]
    if @movie.director and !@movie.director.empty?